Reports/КассоваяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КассоваяКнига</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересчитатьНомера</Name>
					<Comment>Пересчитать номера листов с начала года</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОснования</Name>
					<Comment>При установке этого флажка в графе кассовой книги¶"От кого получено или кому выдано" будет ¶выводиться содержание полей "Принято от" и¶"Основание" приходного кассового ордера или¶"Выдано" и "Основание" расходного кассового ордера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийЛист</Name>
					<Comment>Внешний вид последнего листа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/НомераЛистовКассовойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НомераЛистовКассовойКниги</Name>
			<Comment>(общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЛиста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствКассеККМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствРозничнаяВыручка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхДенежныхСредствВБанке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КассоваяКнига/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

Перем мВалютаРегламентированногоУчета;

Функция ПроверкаПериода()

	ПроверкаПройдена = Истина;

	Если ДатаНач > ДатаКон Тогда
		
		Предупреждение("Неправильно задан период формирования отчета!" + Символы.ПС + "Дата начала больше даты окончания периода.");
		ПроверкаПройдена = Ложь;
		
	ИначеЕсли ДатаНач = '00010101' Тогда
		
		Предупреждение("Не указана дата начала отчета");
		ПроверкаПройдена = Ложь;
		
	ИначеЕсли ДатаКон = '00010101' Тогда
		
		Предупреждение("Не указана дата конца отчета");
		ПроверкаПройдена = Ложь;
		
	КонецЕсли;

	Возврат ПроверкаПройдена;

КонецФункции

Процедура СформироватьОтчет(ДокументРезультат) Экспорт

	Перем ДатаЛиста;
	
 ЕстьРегистр = НЕ Метаданные.РегистрыСведений.Найти("НомераЛистовКассовойКниги") = Неопределено;

	Если НЕ ПроверкаПериода() Тогда
		Возврат;
	КонецЕсли;

	ДокументРезультат.Очистить();
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КассоваяКнига";

	НачалоГода = НачалоГода(ДатаНач);

	// расчет номера начального листа
	// осуществляется по проводкам так как не все операции по
	// кассе оформляются приходными/расходными ордерами

	ЛистовЗаГод = 0;
	ЛистовЗаМесяц = 0;
	
	Если ЕстьРегистр Тогда
		
		Если ПересчитатьНомера Тогда
			
			Номера = РегистрыСведений.НомераЛистовКассовойКниги.СоздатьНаборЗаписей();
			Номера.Отбор.Касса.Значение = Касса;
			Номера.Отбор.Касса.Использование = Истина;
			Номера.Прочитать();
			Номера.Очистить();
			Номера.Записать();
			
		Иначе
			
			Если ДатаНач <> НачалоГода Тогда
				
				Номера = РегистрыСведений.НомераЛистовКассовойКниги.СрезПоследних(ДатаНач - 86400, Новый Структура("Касса", Касса));
				
				Если Номера.Количество()>0 Тогда
					
					Если Номера[0].Период >= НачалоГода Тогда
						
						ЛистовЗаГод = Номера[0].НомерЛиста;
						ЛистовЗаМесяц = Номера[0].НомерЛиста;
						
					КонецЕсли;
					
					
					Номера = РегистрыСведений.НомераЛистовКассовойКниги.СрезПоследних(НачалоМесяца(ДатаКон) - 86400, Новый Структура("Касса", Касса));
					
					Если Номера.Количество()>0 Тогда
						
						Если Номера[0].Период >= НачалоГода Тогда
							ЛистовЗаМесяц = ЛистовЗаГод - Номера[0].НомерЛиста;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	// Инициируем области отчета

	Макет = ПолучитьМакет("КассоваяКнига");

	//////////////////////////////////////////////////////////////////////////////////////////
	
	ОбластьПодвалОтчет = Макет.ПолучитьОбласть("Подвал|Отчет");
	ОбластьВТомЧислеОтчет = Макет.ПолучитьОбласть("ВТомЧисле|Отчет");
	ОбластьОстатокОтчет = Макет.ПолучитьОбласть("Остаток|Отчет");
	ОбластьЛистовЗаМесяцОтчет = Макет.ПолучитьОбласть("ЛистовЗаМесяц|Отчет");
	ОбластьЛистовЗаГодОтчет = Макет.ПолучитьОбласть("ЛистовЗаГод|Отчет");
	ОбластьВкладнойЛистОтчет = Макет.ПолучитьОбласть("ВкладнойЛист|Отчет");
	ОбластьОтчетКассираОтчет = Макет.ПолучитьОбласть("ОтчетКассира|Отчет");
	ОбластьШапкаОтчет = Макет.ПолучитьОбласть("Шапка|Отчет");
	ОбластьОстатокНаНДОтчет = Макет.ПолучитьОбласть("ОстатокНаНД|Отчет");
	ОбластьПереносОтчет = Макет.ПолучитьОбласть("Перенос|Отчет");
	ОбластьСтрокаШирокаяОтчет = Макет.ПолучитьОбласть("СтрокаШирокая|Отчет");
	ОбластьСтрокаОтчет = Макет.ПолучитьОбласть("Строка|Отчет");
	ОбластьОборотОтчет = Макет.ПолучитьОбласть("Оборот|Отчет");
	ОбластьОборотРубОтчет = Макет.ПолучитьОбласть("ОборотРуб|Отчет");
	ОбластьКонечныйОстатокОтчет = Макет.ПолучитьОбласть("КонечныйОстаток|Отчет");

	////////////////////////////////////////////////////////////////////////////////////////////////

	НачИтоги = ?(ПересчитатьНомера, НачалоГода, ДатаНач);

	ЗапросПоИтогам = Новый Запрос;
	ЗапросПоИтогам.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредства.Период КАК Период, 
	|	ДенежныеСредства.СуммаНачальныйОстаток КАК СуммаНачальныйОстатокДт, 
	|	ДенежныеСредства.СуммаКонечныйОстаток КАК СуммаКонечныйОстатокДт, 
	|	ДенежныеСредства.СуммаПриход КАК СуммаОборотДт, 
	|	ДенежныеСредства.СуммаРасход КАК СуммаОборотКт
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(&НачИтоги, &ДатаКон, ДЕНЬ, Движения, ВидДенежныхСредств = &ВидДенежныхСредств И Организация = &ОсновнаяОрганизация" + 
	?(ЗначениеЗаполнено(Касса), " И БанковскийСчетКасса = &Касса", "") + ") КАК ДенежныеСредства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ
	|	СУММА(СуммаНачальныйОстатокДт), 
	|	СУММА(СуммаКонечныйОстатокДт), 
	|	СУММА(СуммаОборотДт), 
	|	СУММА(СуммаОборотКт)
	|ПО
	|	ОБЩИЕ, 
	|	Период ПЕРИОДАМИ(ДЕНЬ, , )
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗапросПоИтогам.УстановитьПараметр("НачИтоги", НачалоДня(НачИтоги));
	ЗапросПоИтогам.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	
	Если ЗначениеЗаполнено(Касса) Тогда
		ЗапросПоИтогам.УстановитьПараметр("Касса", Касса);
	КонецЕсли;
	
	ЗапросПоИтогам.УстановитьПараметр("ВидДенежныхСредств", Перечисления.ВидыДенежныхСредств.Наличные);
	ЗапросПоИтогам.УстановитьПараметр("ОсновнаяОрганизация", Константы.ОсновнаяОрганизация.Получить());
	РезультатЗапросаПоИтогам = ЗапросПоИтогам.Выполнить();
	
	//+Марков И. 10.07.2024 #UT10-4593
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.Текст = 
	"ВЫБРАТЬ
	|	КассовыеДокументы.Документ КАК Документ,
	|	НАЧАЛОПЕРИОДА(КассовыеДокументы.Документ.Дата, ДЕНЬ) КАК День,
	|	КассовыеДокументы.Документ.Дата КАК ДатаДок,
	|	КассовыеДокументы.Документ.Номер КАК НомерДок,
	|	КассовыеДокументы.Документ.ВалютаДокумента КАК Валюта,
	|	КассовыеДокументы.Документ.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА КассовыеДокументы.Документ ССЫЛКА Документ.РасходныйКассовыйОрдер
	|				И КассовыеДокументы.Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВзносНаличнымиВБанк)
	|			ТОГДА ""Сдача наличных денежных средств""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КассовыеДокументы.Документ.ДоговорКонтрагента.РозничнаяПродажа
	|						ИЛИ КассовыеДокументы.Документ.ДоговорКонтрагента.ЛицевойСчет
	|					ТОГДА ""Розничный покупатель""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА КассовыеДокументы.Документ.Контрагент ССЫЛКА Справочник.Контрагенты
	|							ТОГДА КассовыеДокументы.Документ.Контрагент.НаименованиеПолное
	|						ИНАЧЕ ВЫБОР
	|								КОГДА КассовыеДокументы.Документ.Контрагент ССЫЛКА Справочник.ФизическиеЛица
	|									ТОГДА КассовыеДокументы.Документ.Контрагент.Наименование
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ТекстДок,
	|	ВЫБОР
	|		КОГДА КассовыеДокументы.Документ ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА КассовыеДокументы.Документ.СуммаДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР
	|		КОГДА КассовыеДокументы.Документ ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА КассовыеДокументы.Документ.СуммаДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриходныйКассовыйОрдер.Ссылка КАК Документ
	|	ИЗ
	|		Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|	ГДЕ
	|		ПриходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
	|		И ПриходныйКассовыйОрдер.Дата МЕЖДУ &НачИтоги И &ДатаКон
	|		И ПриходныйКассовыйОрдер.Проведен
	|		И ПриходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
	|		И ПриходныйКассовыйОрдер.Организация = &ОсновнаяОрганизация
	|		И ВЫБОР
	|				КОГДА &ПроверятьПоКассе
	|					ТОГДА ПриходныйКассовыйОрдер.Касса = &Касса
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходныйКассовыйОрдер.Ссылка
	|	ИЗ
	|		Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|	ГДЕ
	|		РасходныйКассовыйОрдер.Дата МЕЖДУ &НачИтоги И &ДатаКон
	|		И РасходныйКассовыйОрдер.Проведен
	|		И РасходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
	|		И РасходныйКассовыйОрдер.Организация = &ОсновнаяОрганизация
	|		И ВЫБОР
	|				КОГДА &ПроверятьПоКассе
	|					ТОГДА РасходныйКассовыйОрдер.Касса = &Касса
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК КассовыеДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	День,
	|	ДатаДок,
	|	Документ
	|ИТОГИ ПО
	|	День,
	|	Документ
	|АВТОУПОРЯДОЧИВАНИЕ";

	ЗапросПоДокументам.УстановитьПараметр("НачИтоги", НачалоДня(НачИтоги));
	ЗапросПоДокументам.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	ЗапросПоДокументам.УстановитьПараметр("ПроверятьПоКассе", ЗначениеЗаполнено(Касса));
	ЗапросПоДокументам.УстановитьПараметр("Касса", ?(ЗначениеЗаполнено(Касса), Касса, Справочники.Кассы.ПустаяСсылка()));
	//-Марков И. 10.07.2024 #UT10-4593
	
	ЗапросПоДокументам.УстановитьПараметр("ОсновнаяОрганизация", Константы.ОсновнаяОрганизация.Получить());
	//ЗапросПоДокументам.УстановитьПараметр("ОперацияПриемРозничнойВыручки", Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка);
	
	РезультатЗапросаПоДокументам = ЗапросПоДокументам.Выполнить();
	
	ТаблицаДокументы = РезультатЗапросаПоДокументам.Выгрузить();
	ТаблицаДокументы.Очистить();
	ТаблицаДокументы.Колонки.Добавить("Валютный");
	ТаблицаДокументы.Колонки.Добавить("ВидДокумента");
	
	ВыборкаОбщихИтогов = РезультатЗапросаПоИтогам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период");
	
	ВыборкаИтоговПоДням = РезультатЗапросаПоИтогам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период");
	ВыборкаДокументовПоДням = РезультатЗапросаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "День");
	
	ПоПроводкам = ВыборкаИтоговПоДням.Следующий();
	ПоДокументам = ВыборкаДокументовПоДням.Следующий();
	
	БылиОшибки = Ложь;
	ВывестиПодвал = Ложь;
	
	ТипПКО = Тип("ДокументСсылка.ПриходныйКассовыйОрдер");
	ТипРКО = Тип("ДокументСсылка.РасходныйКассовыйОрдер");
		
	Пока ПоПроводкам Или ПоДокументам Цикл
		
		Если НЕ ПоПроводкам Тогда
			ДатаЛиста = ВыборкаДокументовПоДням.День;
		ИначеЕсли НЕ ПоДокументам Тогда
			ДатаЛиста = ВыборкаИтоговПоДням.Период;
		Иначе 
			ДатаЛиста = Мин(ВыборкаДокументовПоДням.День, ВыборкаИтоговПоДням.Период);
		КонецЕсли;
		
		Если ВыборкаИтоговПоДням.СуммаОборотДт = 0 И ВыборкаИтоговПоДням.СуммаОборотКт = 0 Тогда
			
			Если НЕ ПоДокументам ИЛИ ДатаЛиста <> ВыборкаДокументовПоДням.День Тогда
				
				ПоПроводкам = ВыборкаИтоговПоДням.Следующий();
				Продолжить; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		НомерЛиста = ЛистовЗаГод + 1;
		ЛистовЗаГод = ЛистовЗаГод + 1;
		ЛистовЗаМесяц = ЛистовЗаМесяц + 1;
		
		КоличествоПриходныхДокументов = 0;
		КоличествоРасходныхДокументов = 0;
		
		Если ВыборкаОбщихИтогов.Следующий() Тогда		
		
			Остаток = ВыборкаОбщихИтогов.СуммаНачальныйОстатокДт;
		
		Иначе
		
			Остаток = 0;
		
		КонецЕсли;
		
		Если ДатаЛиста >= ДатаНач Тогда
			
			ОбластьВкладнойЛистОтчет.Параметры.ЗаголовокЛиста = "КАССА за " + Формат(ДатаЛиста, "ДФ = dd.MM.yyyy");
			ДокументРезультат.Вывести(ОбластьВкладнойЛистОтчет);
			
			ОбластьОтчетКассираОтчет.Параметры.ЗаголовокЛиста = "КАССА за " + Формат(ДатаЛиста, "ДФ = dd.MM.yyyy");
			ДокументРезультат.Присоединить(ОбластьОтчетКассираОтчет);
			
			ОбластьШапкаОтчет.Параметры.ТекстНомерЛиста = "Лист " + НомерЛиста;
			ДокументРезультат.Вывести(ОбластьШапкаОтчет);
			ДокументРезультат.Присоединить(ОбластьШапкаОтчет);
			
			ОбластьОстатокНаНДОтчет.Параметры.ОстатокНачало = Остаток;
			ДокументРезультат.Вывести(ОбластьОстатокНаНДОтчет);
			ДокументРезультат.Присоединить(ОбластьОстатокНаНДОтчет);
			
		КонецЕсли;
 
		ВысотаСтроки = ?(ВыводитьОснования = 1, 4, 2);// высота секции документа
		СтрокШапки = 9;
		СтрокПодвала = 13;
		
		ТаблицаДокументы.Очистить();
		Валюты = Новый СписокЗначений;
				
		Если ПоДокументам И ВыборкаДокументовПоДням.День = ДатаЛиста Тогда
			
			ВыборкаДокументов = ВыборкаДокументовПоДням.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
			
			Пока ВыборкаДокументов.Следующий() Цикл
				
				НоваяСтрока = ТаблицаДокументы.Добавить();
				НоваяСтрока.ВидДокумента = ?(ТипЗнч(ВыборкаДокументов.Документ) = ТипПКО, "ПриходныйОрдер", "РасходныйОрдер");
				НоваяСтрока.Документ = ВыборкаДокументов.Документ;
				НоваяСтрока.ДатаДок = ВыборкаДокументов.ДатаДок;
				НоваяСтрока.День = ВыборкаДокументов.День;
				НоваяСтрока.НомерДок = ВыборкаДокументов.НомерДок;
				НоваяСтрока.Валюта = ВыборкаДокументов.Валюта;
				НоваяСтрока.Приход = ВыборкаДокументов.Приход;
				НоваяСтрока.Расход = ВыборкаДокументов.Расход;
				НоваяСтрока.Основание = ВыборкаДокументов.Основание;
				НоваяСтрока.ТекстДок = ВыборкаДокументов.ТекстДок;
				
				Если Не ВыборкаДокументов.Валюта = мВалютаРегламентированногоУчета Тогда
					
					Валюты.Добавить(ВыборкаДокументов.Валюта);
					НоваяСтрока.Валютный = Истина;
					
				Иначе
					НоваяСтрока.Валютный = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		СумПриход = 0;
		СумРасход = 0;
		ПерваяСтрока = 1;
		// Для простоты настройки печатной формы примем следующие соглашения:
		// - высота строк в таблице печатной формы задана жестко, 
		//		тогда известно, сколько строк помещается на странице;
		СтрокНаСтранице = 54;
		// - высота шапки и подвала задана жестко и кратна высоте строк таблицы, 
		//		тогда можно указать, сколько строк занимают шапка и подвал
		//		в пересчете на строки таблицы;
		// - Количество строк шапки определено при выводе валюты в шапку;
		// - Количество строк подвала определим позже по количеству валют;
		// - для нормальной работы алгоритма необходимо, чтобы шапка и подвал
		//		могли поместиться на одной странице + хотя бы одна строка таблицы:
		//		СтрокНаСтранице >= СтрокШапки + СтрокПодвала + 1
		// - если подвал не помещается на странице, он переносится на другую
		//		страницу с последней строкой;исключение составляет случай, 
		//		когда в таблице всего одна строка.
		
		// По каждой валюте добавляется:
		// 2 строки для оборота;
		// 2 строки для остатка;
		// 1 строка под курсовую разницу.
		// Для рублей добавляется:
		// 1 строка для оборота;
		// 1 строка для остатка.
		// Добавляет строка для секции "КурсоваяРазница" и "ВТомЧисле".
		СтрокПодвала = 0;
		
		// Резервирование строк подвала для секции "ЛистовЗаМесяц" и "ЛистовЗаГод".
		СтрокПодвала = СтрокПодвала + ?(ПоследнийЛист > 0, ПоследнийЛист, 0);
		
		// Если ПереноситьПоследнююСтроку = 1 - переносить, 
		// если ПереноситьПоследнююСтроку = 0 - не надо переносить:
		Если (ТаблицаДокументы.Количество() * ВысотаСтроки) <= (СтрокНаСтранице - СтрокШапки - СтрокПодвала) Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			
			ЦелыхСтраницСПодвалом = Цел(((СтрокШапки - 5) + ТаблицаДокументы.Количество()*ВысотаСтроки + СтрокПодвала - 1)/(СтрокНаСтранице - 5));
			ЦелыхСтраницБезПодвала = Цел(((СтрокШапки - 5) + ТаблицаДокументы.Количество()*ВысотаСтроки - 1)/(СтрокНаСтранице - 5));
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
			
		КонецЕсли;
		
		КоличествоСтраниц = 1;
		Индекс = 1;
		ИтогПриходПоСтранице = 0;
		ИтогРасходПоСтранице = 0;
		
		Для Каждого Документ Из ТаблицаДокументы Цикл
			
			Если Документ.ВидДокумента = "ПриходныйОрдер" или Документ.ВидДокумента = "РасходныйОрдер" Тогда
				ЕстьВалюта = Документ.Валютный;
			Иначе
				ЕстьВалюта = Ложь;
			КонецЕсли;
			
			Если ЕстьВалюта Тогда
				
				Валюта = Документ.Валюта;
				СтруктураКурсов = ОбщегоНазначения.ПолучитьКурсВалюты(Валюта, Документ.ДатаДок);
				
				Курс = СтруктураКурсов.Курс;
				Кратность = СтруктураКурсов.Кратность;
				Кратность = ?(Кратность = 0, 1, Кратность);
				
			Иначе
				
				Валюта = Справочники.Валюты.ПустаяСсылка();
				Курс = 1;
				Кратность = 1;
				
			КонецЕсли;
				
			Если Документ.ВидДокумента = "РасходныйОрдер" Тогда
				
				//+Гавриленков В. 06.08.2026 #UT10-6001
				//Клиент = "Выдано " + СокрЛП(?(Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк, "Сдача наличных денежных средств", "")) + ?(ВыводитьОснования = 1, ". " + СокрЛП(Документ.Основание), "");
				Клиент = "Выдано " + СокрЛП(?(Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк, "Сдача наличных денежных средств",  ?(Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику, Документ.ТекстДок, ""))) + ?(ВыводитьОснования = 1, ". " + СокрЛП(Документ.Основание), "");
				//-Гавриленков В. 06.08.2026 #UT10-6001
				КоличествоРасходныхДокументов = КоличествоРасходныхДокументов + 1;
				ВалРасход = Документ.Расход;
				Расход = Окр(Документ.Расход*Курс/Кратность, 2, 1);
				ВалПриход = 0;
				Приход = 0;
				
			Иначе
				
				Клиент = "Принято от " + СокрЛП(Документ.ТекстДок) + ?(ВыводитьОснования = 1, ". " + СокрЛП(Документ.Основание), "");
				КоличествоПриходныхДокументов = КоличествоПриходныхДокументов + 1;
				ВалПриход = Документ.Приход;
				Приход = Окр(Документ.Приход*Курс/Кратность, 2, 1);
				ВалРасход = 0;
				Расход = 0;
				
			КонецЕсли;
			
			ИтогПриходПоСтранице = ИтогПриходПоСтранице + Приход;
			ИтогРасходПоСтранице = ИтогРасходПоСтранице + Расход;

			НомерДокПечатнойФормы = ОбщегоНазначения.ПолучитьНомерНаПечать(Документ.Документ);
			
			// Начинаем новую страницу, если предыдущая строка была последней на странице
			// или пора переносить последнюю строку на последнюю страницу с подвалом.
			ЦелаяСтраница = Цел(((СтрокШапки - 5) + (КоличествоСтраниц - 1) + (Индекс*ВысотаСтроки) - 1)/(СтрокНаСтранице - 5));
			Если (ЦелаяСтраница = КоличествоСтраниц) или 
			 ((ПереноситьПоследнююСтроку = 1) и (Индекс = ТаблицаДокументы.Количество())) Тогда
			 
				ПриходЗаДень = ТаблицаДокументы.Итог("Приход");
				РасходЗаДень = ТаблицаДокументы.Итог("Расход");
				
				Если ДатаЛиста >= ДатаНач Тогда
					
					ОбластьПереносОтчет.Параметры.ПриходЗаДень = ИтогПриходПоСтранице;
					ОбластьПереносОтчет.Параметры.РасходЗаДень = ИтогРасходПоСтранице;
					
					ДокументРезультат.Вывести(ОбластьПереносОтчет);
					ДокументРезультат.Присоединить(ОбластьПереносОтчет);
					
				КонецЕсли;
				
				НомерЛиста = НомерЛиста + 1;
				КоличествоСтраниц = КоличествоСтраниц + 1;
				ЛистовЗаГод = ЛистовЗаГод + 1;
				ЛистовЗаМесяц = ЛистовЗаМесяц + 1;
				
				Если ДатаЛиста >= ДатаНач Тогда
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ОбластьШапкаОтчет.Параметры.ТекстНомерЛиста = "Лист " + НомерЛиста;
					ДокументРезультат.Вывести(ОбластьШапкаОтчет);
					ДокументРезультат.Присоединить(ОбластьШапкаОтчет);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДатаЛиста >= ДатаНач Тогда
				
				Если ТипЗнч(Документ.Документ) = ТипПко тогда 
					
					Если Документ.Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя тогда 
						Счет = "62.01, 62.02";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником тогда 
						Счет = "71.01";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком тогда 
						Счет = "60.01, 60.02";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхДенежныхСредствВБанке тогда 
						Счет = "51";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийПКО.ПрочиеРасчетыСКонтрагентами тогда 
						Счет = "76.05";
					Иначе
						Счет = "";
					КонецЕсли
					
				ИначеЕсли ТипЗнч(Документ.Документ) = ТипРко тогда
					
					Если Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк тогда
						Счет = "57.01";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику тогда 
						Счет = "60.01, 60.02";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю тогда 
						Счет = "62.01, 62.02";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами тогда 
						Счет = "76.05";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику тогда 
						Счет = "71.01";
					ИначеЕсли Документ.Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлаты тогда 
						Счет = "70";
					КонецЕсли;
					
				Иначе
					Счет = "";
				КонецЕсли;
			
				Если ВыводитьОснования Тогда
						
					ОбластьСтрокаШирокаяОтчет.Параметры.НомерДокПечатнойФормы = НомерДокПечатнойФормы;
					ОбластьСтрокаШирокаяОтчет.Параметры.Контрагент = Клиент;
					ОбластьСтрокаШирокаяОтчет.Параметры.Приход = Приход;
					ОбластьСтрокаШирокаяОтчет.Параметры.Расход = Расход;
					ОбластьСтрокаШирокаяОтчет.Параметры.Документ = Документ.Документ;
					ОбластьСтрокаОтчет.Параметры.Счет = Счет;
					ДокументРезультат.Вывести(ОбластьСтрокаШирокаяОтчет);
					ДокументРезультат.Присоединить(ОбластьСтрокаШирокаяОтчет);
						
				Иначе
						
					ОбластьСтрокаОтчет.Параметры.НомерДокПечатнойФормы = НомерДокПечатнойФормы;
					ОбластьСтрокаОтчет.Параметры.Контрагент = Клиент;
					ОбластьСтрокаОтчет.Параметры.Приход = Приход;
					ОбластьСтрокаОтчет.Параметры.Расход = Расход;
					ОбластьСтрокаОтчет.Параметры.Документ = Документ.Документ;
					ОбластьСтрокаОтчет.Параметры.Счет = Счет;
					
					ДокументРезультат.Вывести(ОбластьСтрокаОтчет);
					ДокументРезультат.Присоединить(ОбластьСтрокаОтчет);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
		ПриходЗаДень = ТаблицаДокументы.Итог("Приход");
		РасходЗаДень = ТаблицаДокументы.Итог("Расход");
		
		Если ДатаЛиста >= ДатаНач Тогда
			
			ОбластьОборотОтчет.Параметры.ПриходЗаДень = ПриходЗаДень;
			ОбластьОборотОтчет.Параметры.РасходЗаДень = РасходЗаДень;
			
			ДокументРезультат.Вывести(ОбластьОборотОтчет);
			ДокументРезультат.Присоединить(ОбластьОборотОтчет);
			
		КонецЕсли;
		
		ПерваяСтрока = Истина;
		Остаток = Остаток + ПриходЗаДень - РасходЗаДень;
				
		Если ДатаЛиста >= ДатаНач Тогда
			
			ОбластьКонечныйОстатокОтчет.Параметры.ОстатокКонец = Остаток;
			
			ДокументРезультат.Вывести(ОбластьКонечныйОстатокОтчет);
			ДокументРезультат.Присоединить(ОбластьКонечныйОстатокОтчет);
		
			ОбластьПодвалОтчет.Параметры.НадписьКолПриходныхРасходных = ?(КоличествоПриходныхДокументов>0, ЧислоПрописью(КоличествоПриходныхДокументов, "НД = Ложь", ", , , , , , , , 0"), " - ") + "приходных и " + 
			?(КоличествоРасходныхДокументов>0, ЧислоПрописью(КоличествоРасходныхДокументов, "НД = Ложь", ", , , , , , , , 0"), " - ") + "расходных получил.";
			
			Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"), КонецДня(ДатаЛиста), );
			
			ОбластьПодвалОтчет.Параметры.ГлБухгалтер = Руководители.ГлавныйБухгалтер;
			ОбластьПодвалОтчет.Параметры.Кассир = Руководители.Кассир;
			
			ДокументРезультат.Вывести(ОбластьПодвалОтчет);
			ДокументРезультат.Присоединить(ОбластьПодвалОтчет);
			
		КонецЕсли;
		
		Если ПоПроводкам И ДатаЛиста = ВыборкаИтоговПоДням.Период Тогда
			ПоПроводкам = ВыборкаИтоговПоДням.Следующий();
		КонецЕсли;
		
		Если ПоДокументам И ДатаЛиста = ВыборкаДокументовПоДням.День Тогда
			ПоДокументам = ВыборкаДокументовПоДням.Следующий();
		КонецЕсли;
		
		// Проверим, если месяц закончился, то выведем кличество листов
		Если (ПоПроводкам И МЕСЯЦ(ДатаЛиста) <> МЕСЯЦ(ВыборкаИтоговПоДням.Период))
			ИЛИ (ПоДокументам И МЕСЯЦ(ДатаЛиста) <> МЕСЯЦ(ВыборкаДокументовПоДням.День)) Тогда
		
			ОбластьЛистовЗаМесяцОтчет.Параметры.НадписьЛистовЗаМесяц = "Количество листов кассовой книги за месяц: " + ЛистовЗаМесяц;
			ДокументРезультат.Вывести(ОбластьЛистовЗаМесяцОтчет);
			ДокументРезультат.Присоединить(ОбластьЛистовЗаМесяцОтчет);
			
			ЛистовЗаМесяц = 0;
			
		КонецЕсли;
		
		Если ПоПроводкам или ПоДокументам Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ВывестиПодвал = Истина;
		
		Если ЕстьРегистр Тогда
			
			ТекНомера = РегистрыСведений.НомераЛистовКассовойКниги.СрезПоследних(ДатаЛиста, Новый Структура("Касса", Касса));
			
			Если ТекНомера.Количество() = 0 ИЛИ ТекНомера[0].НомерЛиста <> НомерЛиста Тогда
				
				Номера = РегистрыСведений.НомераЛистовКассовойКниги.СоздатьНаборЗаписей();
				Номера.Отбор.Касса.Значение = Касса;
				Номера.Отбор.Касса.Использование = Истина;
				Номера.Отбор.Период.Значение = ДатаЛиста;
				Номера.Отбор.Период.Использование = Истина;
				НоваяЗапись = Номера.Добавить();
				НоваяЗапись.Касса = Касса;
				НоваяЗапись.Период = ДатаЛиста;
				НоваяЗапись.НомерЛиста = НомерЛиста;
				Номера.Записать(); 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Если ВывестиПодвал Тогда
		
		Д = ДатаКон;
		
		Если (НачалоДня(КонецМесяца(ДатаЛиста)) = ДатаЛиста) Или
		 (НачалоМесяца(ДатаЛиста) <> НачалоМесяца(ДатаКон)) Или
		 (ПоследнийЛист <> 0) Тогда
			
			ОбластьЛистовЗаМесяцОтчет.Параметры.НадписьЛистовЗаМесяц = "Количество листов кассовой книги за месяц: " + ЛистовЗаМесяц;
			ДокументРезультат.Вывести(ОбластьЛистовЗаМесяцОтчет);
			ДокументРезультат.Присоединить(ОбластьЛистовЗаМесяцОтчет);
			
		КонецЕсли;
		
		Если (НачалоДня(КонецГода(ДатаЛиста)) = ДатаЛиста) Или 
		 (НачалоГода(ДатаЛиста) <> НачалоГода(ДатаКон)) Или 
		 (ПоследнийЛист = 2) Тогда
			
			ОбластьЛистовЗаГодОтчет.Параметры.НадписьЛистовЗаГод = "Количество листов кассовой книги за год: " + ЛистовЗаГод;
			ДокументРезультат.Вывести(ОбластьЛистовЗаГодОтчет);
			ДокументРезультат.Присоединить(ОбластьЛистовЗаГодОтчет);
			
			// Печать обложки и титульного листа
			Т1 = Новый ТабличныйДокумент;
			Макет1 = ПолучитьМакет("Обложка");
			ОбластьОбложка = Макет1.ПолучитьОбласть("Обложка");
			ОбластьОбложка.Параметры.НазваниеОрганизации = ?(Касса.Владелец.НаименованиеПолное = "", Касса.Владелец.Наименование, Касса.Владелец.НаименованиеПолное);
			ОбластьОбложка.Параметры.НадписьОбложка = " на " + Год(ДатаЛиста) + " г.";
			ОбластьОбложка.Параметры.КодОКПО = Касса.Владелец.КодПоОКПО;	
			Т1.Вывести(ОбластьОбложка);
			Т1.ВывестиГоризонтальныйРазделительСтраниц();
			Т1.Вывести(ОбластьОбложка);
			
			// Последний лист кассовой книги
			Т1.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьПослДеньГода = Макет1.ПолучитьОбласть("ПослДеньГода");
			
			Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Касса.Владелец, КонецДня(ДатаЛиста), );
						
			ОбластьПослДеньГода.Параметры.ГлБухгалтер = Руководители.ГлавныйБухгалтер;
			ОбластьПослДеньГода.Параметры.Руководитель = Руководители.Руководитель;
			ОбластьПослДеньГода.Параметры.РуководительДолжность = Руководители.РуководительДолжность;
			ОбластьПослДеньГода.Параметры.ЛистовЗаГод = ЛистовЗаГод;
			Т1.Вывести(ОбластьПослДеньГода);
			Т1.ОтображатьСетку = Ложь;
			Т1.ОтображатьЗаголовки = Ложь;
			
			Т1.Показать("Обложка и титульный лист кассовой книги", "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументРезультат.ТолькоПросмотр = Истина;
			
КонецПроцедуры

НП = Новый НастройкаПериода;

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецЕсли
